{
  "url": "https://netamorphosis.com/join-us/design-director/",
  "title": "Design Director",
  "department": "Client Services",
  "location": "New York City",
  "type": "Full Time",
  "experience": "8+ Years",
  "body": "<p><strong>Overview</strong></p><p>Design Directors are the driving force keeping the creative side of n e t a on the pioneering edge of digital platform design.&nbsp; They make sure that no talent goes to waste and that the work stays sharp, relevant, and most importantly enduring design in the digital age. Design Directors develop original design concepts, industry-changing marketing campaigns, and compelling B2B/B2C solutions, innovative commerce designs with exposure to sprint-based iterative design process and systems. They have an intuitive feeling for the way an experience should work, and a deep understanding of what users want and need when it comes to interacting with brands and businesses in digital.&nbsp; The work includes digital strategy and interaction design across any touch point – web, mobile, social, tablet, in-store and emerging platforms. We want a Design Director whose craft is high and likes getting her/his hands dirty when needed: you lead by example and you can show how it’s done. They will oversee a team of 4 to 5 design resources, ranging from Sr. Graphic Designers, Sr. Manager of UX Design, Graphic Designers, Jr. Graphic Designers/Digital Project Coordinators to 3<sup>rd</sup> Party design resources for overflow. &nbsp;They will partner with our Dev integration team, our 3<sup>rd</sup> Party developers and project managers.&nbsp; We need someone who can be a strategic product owner, a team player and a skilled client partner all rolled into one. You’ll be a thoughtful thinker, collaborative problem solver, and an engaging client and team builder.</p><p><strong>About n e t a </strong></p><p>We are considered digital pioneers…we get excited by new technology, new ways to communicate and leading the ways that businesses captivate their audiences. We believe in the power of the group, and that an empowered, trusted and an open team format works better than one that’s constricted by hierarchy or the silho’ effect.&nbsp; We work hard and play right, and counter to traditional digital agency culture, we prioritize healthy living within the hustle of delivering cutting edge digital platforms.&nbsp; We are bound by our diversification of work subject matter, and the reality that at our core we are builders.&nbsp; We’re a close-knit, collaborative group, guided by a highly iterative user-centered design process. n e t a is a technology-first growth focused partner resource.&nbsp; Our team has the DNA of several startups merged together. Combining research, data, and thoughtful critique, we’re discovering needs and solving fundamental problems that impact industries ranging from healthcare to the leading edge of interactive entertainment that impacts the lives of millions of people.</p>"
}