{
  "url": "https://netamorphosis.com/join-us/performance-analyst/",
  "title": "Performance Analyst",
  "department": "Client Services",
  "location": "New York City",
  "type": "Full Time",
  "experience": "2 - 4+ Years",
  "body": "<p>Our Performance Analysts are our #’s people, and like their counterparts on the Design &amp; Build side, they’re the people who ensure that we meet and exceed not only our client’s expectations, but those of the markets in which we penetrate and most importantly our own standards. We presently average a +165% 3-Year CAGR for those companies that&nbsp;<a href=\"https://netamorphosis.com/about/why-choose-us/\">choose to work with us</a>&nbsp;as defined within the n e t a client index. These technical thinkers lay the foundations that project baseline vs. strategic analytical and ultimately financial performance that sets the course for what materializes into our client’s unprecedented growth trajectories. They then expand upon these projections to build comprehensive financial models that have contributed to&nbsp;<a href=\"https://netamorphosis.com/services/capital-raising/\">capital raising</a>&nbsp;more than $78M + in Friends &amp; Family, Debt, Series A – C to date, and hundreds of millions of business performance on top of that.</p><p>&nbsp;</p><p>Performance Analysts ensure that technology and omnichannel platforms can be quantified, calculated and reported against, which directs our collective path forward. They use analytical skills for insight development and are comfortable presenting strategic direction to our clients. Our Performance Analysts ultimately build credibility, resourcing and security into the relationships we cultivate with our clients, with our paid media, and our strategic and investment partners, while working hand-in-hand with developers to (simply put) ‘make things happen’. The person who fulfills this valued role within our Client Services team is driven, an effective and detailed communicator, and a problem solver. They are autonomous in ensuring the work gets done, meets our collective standards, and paves the way forward on a growing team to ensure communication and on-going neta + client materials reflect adapted methodologies.</p><h2>Must Have:</h2><p>Are our next Performance Analyst?</p><ul><li>Has at least 2 – 3+ years experience in compiling data analytics for a digital,&nbsp;<a href=\"https://netamorphosis.com/services/ecommerce/\">eCommerce</a> (bonus points!)&nbsp;or&nbsp;<a href=\"https://netamorphosis.com/services/omnichannel/\">omnichannel</a>&nbsp;attribution</li><li>Bachelor’s degree with major in finance, mathematics, marketing or economics</li><li>An analytical and technical thinker, not afraid of languages or adapting to new software/internet technologies, with exposure to eCommerce, qualitative research strategy/practice, and strategy development a plus</li><li>Highly organized with the ability to prioritize/multi-task– demonstrated capabilities regarding email, calendar and spreadsheet creation/management</li><li>You have the technical competence to performing data analytics and have utilized web analytics for marketing budget optimizations</li><li>Experience w/ identifying and engineering KPIs, creating and running weekly/monthly reports that measure these and skilled at crafting actionable insights</li><li>Demonstrated knowledge of statistics, ROI, A/B testing and lift measurement</li><li>Experience/Exposure to database management and query/manipulation</li><li>Strong analytical skills and confidence in utilizing data in Excel and other tools e.g. Tableau, MicroStrategy, Power BI</li><li>Exposure and experience with more than one of the following tools and channels to paid digital advertising platforms including Google (Ad Words), You Tube, Facebook, native GDN, other 3<sup>rd</sup> Party platforms and SEO and Email Marketing thru WordPress, Moz, SEMRush, Google Search Console, GT Matrix and Mailchimp</li><li>Experience with Salesforce, Zendesk, or other 3<sup>rd</sup> Party CRM’s vital from an end-to-end customer value perspective</li><li>Analysts at n e t a lead&nbsp;<a href=\"http://netamorphosis.com/what-we-do/glossary?tmpl=component#UAT\">UAT </a>system &amp; data integrations and evaluate performance of business solutions, identify improvements including conversion page optimizations, GA tagging and refine targets for future releases</li><li>Strong communication skills, internally and externally with the ability to be the communication bridge between client services and technology teams on web platform and application development throughout a project life cycle while also distributing best practice C-level and marketing partner performance reporting</li><li>Capable of building knowledge across a dynamic&nbsp;<a href=\"https://netamorphosis.com/services/\">service offering </a>in order to best grow our amazing clients and to navigate your own growth path while at n e t a</li><li>Candidate should be proactive and self-motivated. Strong work ethic, integrity and commitment to meet deadlines are essential candidate attributes</li><li>Passionate about helping companies and someone who values the energy, time and perseverance required to build a business into its greatest potential</li><li>Coding skills a plus/understanding for analytics and data compilation</li><li>Mac proficient with solid experience in all Microsoft Office programs, especially Microsoft Excel, Word and Keynote</li></ul><h2>WHEN APPLYING:</h2><ul><li>Include a PDF of your Resume and Cover Letter (where we evaluate writing style)</li><li>Complete our questionnaire</li><li>A URL to your LinkedIn profile (if applicable)</li><li>We’re currently only soliciting candidates authorized to work in the U.S. at this time</li><li>Candidates must be able to work in the NY office</li><li><strong>If selected to interview: </strong>Please be prepared to present at least 1-2 Excel examples that showcase your data &amp; analytical skills and an example of client or executive level report distribution</li></ul><h2>Job Skills:</h2><p>Technical Thinker, Insight Development Experience, Ability to Multi-Task, Big Data, Data Consulting, Project Coordination, Strategic Planning, Strategy Consulting, Digital Consulting, Analytics Consulting, Microsoft Excel, Microsoft Office, Keynote, Power BI, Salesforce, UAT Systems, Problem Solving</p>"
}