{
  "url": "https://netamorphosis.com/join-us/senior-content-strategist/",
  "title": "Senior Content Strategist",
  "department": "Client Services",
  "location": "New York City",
  "type": "Full Time",
  "experience": "5+ Years",
  "body": "<p>We are considered digital pioneers…we get excited by new technology, new ways to communicate and leading the ways that businesses captivate their audiences. We believe in the power of the group, and that an empowered, trusted and an open team format works better than one that’s constricted by hierarchy or the silho’ effect.&nbsp; We work hard and play right, and counter to traditional digital agency culture, we prioritize healthy living within the hustle of delivering cutting edge digital platforms.&nbsp; We are bound by our diversification of work subject matter, and the reality that at our core we are builders.</p><p>Our Sr. Content Strategist is fundamentally a digital thought leader in addition to a content executor who ensures we consistently meet and exceed not only our client’s expectations, but also those of the markets we penetrate and, most importantly, our own standards. Our Sr. Content Strategist is responsible for delivering n e t a’s digital growth strategies in partnership with our clients and laying the foundation for what achieving maximum success can look like.&nbsp; Your ability to translate company goals and consumer needs into powerful, engaging content will contribute to a digital evolution across a wide range of industries and subject matters. The role may see you connecting audiences with an entirely new form of interactive entertainment, combatting one of the leading causes of death in our country through specialized healthcare, elevating and promoting new ways to experience the arts, developing how we personalize fashion as self-expression, and continuing to move the needle forward for inspired non-profits.</p><p>&nbsp;</p><h2>MUST HAVE:</h2><p>Are you our next Sr. Content Strategist?</p><ul><li>Minimum of 5 years experience working as a content lead, senior content manager preferably with strength in project management and resource allocation, with hands-on exposure to content creation from inception to execution</li><li>Experience defining content marketing strategy and plan across multiple channels including digital platform content, social media, email marketing, referral marketing sources, UGC platforms and essentially all touchpoints including offline experiences that drive audience engagement</li><li>Data-driven with fundamental alignment with n e t a’s data-driven approach, with exposure in A/B testing and <span style=\"text-decoration: underline;\"><span style=\"color: #0000ff;\"><a style=\"color: #0000ff; text-decoration: underline;\" href=\"https://netamorphosis.com/services/analytics-consulting/\">analytics consulting</a></span></span></li><li>Experience in project management; someone who is not intimidated by learning best practice project management, stepping in and overseeing a talented team, in addition to the capability to directly execute</li></ul><ul><li>Participate, facilitate and guide client Requirements/Information Architecture Sessions culminating into ‘copy blocked’ content planning documents that serve as the basis for n e t a’s ‘full copy loaded’ wireframing exercise</li><li>Prior experience as the primary writer for client and internal platform initiatives</li><li>Technologically savvy – with a working, best practice knowledge of SEO, UX, CMS administration, and adapting all technical copy into SEO best practice (i.e. meta data, H1 – H3 tagging)</li><li>Highly organized with the ability to prioritize/multi-task– demonstrated capabilities re: variable communication and project management software, email, Google Calendar, project plans and spreadsheet creation/management</li></ul><ul><li>The consummate communicator – excellent professional written/verbal communications and presentation skills are a must both internally and for client relations</li><li>Up-to-date on emerging digital trends and timely content opportunities</li><li>Time management skills and the ability to meet strict deadlines, also comfortable with managing shifting deadlines in line with client expectations and needs</li><li>A sense of ownership for everything you deliver. This requires an entrepreneurial spirit, the capability to move forward with challenges, autonomy and an ability to set aside ego in order to build something amazing</li><li>Working knowledge ideal of the following: WordPress, Magento, Shopify, Asana, Power BI, Mailchimp</li><li>Passionate about helping companies and values the energy, time and perseverance required to build a business into its greatest potential</li></ul><h2>WHEN APPLYING:</h2><ul><li>Include a PDF of your Resume and Cover Letter (where we evaluate writing style)</li><li>Complete our questionnaire</li><li>A URL to your LinkedIn profile (if applicable)</li><li>We’re currently only soliciting candidates authorized to work in the U.S. at this time</li><li>Candidates must be able to work in the NY office</li><li><strong>If selected to interview:</strong> Please be prepared to present at least 1-2 examples that showcase your organizational and content management execution skills</li></ul><h2><strong>Job Skills:</strong></h2><p>Copywriting, Content Strategy, Strategic Thinking, Qualitative Research, ECommerce, SEO, Communication, Project Management, Performance Management, Search Engine Optimization (SEO), Digital Project Management, SEO Copywriting, Content Creation, Content Management Systems (CMS), Market Research, Microsoft Office, Microsoft Word, Microsoft Excel, Keynote, Google Suite,</p>"
}