{
  "url": "https://netamorphosis.com/join-us/senior-project-manager/",
  "title": "Senior Project Manager",
  "department": "Client Services",
  "location": "New York City",
  "type": "Full Time",
  "experience": "6+ Years",
  "body": "<p>At n e t a, Senior Project Managers are cross-functional leaders who help project teams define and deliver the ideal digital experiences for our clients and their customers. We work collaboratively with internal teams, clients, third-party developers on ground-breaking digital projects throughout the entire product development lifecycle. We are looking for a Senior Project Manager experienced in the Software Development Lifecycle processing including assigned marketing technology projects to include enterprise website builds. The Senior Digital Project Manager plans, schedules and controls all project activities toward these objectives, applying technical, theoretical and managerial skills to satisfy project requirements. They will also serve as the ongoing connection between the client and n e t a and work to foster relationships, help with account grown, achieve performance/profitability targets of the n e t a + client team objectives.</p><p>To be successful in this role, you’ll need to be a self-starter and someone who’s comfortable working in an autonomous style. This person can understand and speak to technical concepts while foreseeing challenges and being proactive to mitigate risks. The Senior Project Manager will play a key role in driving the overall development efforts for clients’ websites, as well as, overseeing all marketing cloud efforts, and possesses a track record of thinking strategically about a client’s overall business objectives from both a high-level, as well as, tactical level. They have a bias for action and can break down complex problems into technical steps towards resolution. Successful Senior Project Managers must also creatively and strategically demonstrate problem solving skills while effectively supporting clients and projects to ensure delivery is on time, within budget and to the highest quality. Senior Project Managers are expected to help lead large and complex projects, and mentor their peers, as well as, the project management team to help grow and develop an already collaborative and dedicated team.</p><p>We are considered digital pioneers…we get excited by new technology, new ways to communicate and leading the ways that businesses captivate their audiences. We believe in the power of the group, and that an empowered, trusted and an open team format works better than one that’s constricted by hierarchy or the silho’ effect.&nbsp; We work hard and play right, and counter to traditional digital agency culture, we prioritize healthy living within the hustle of delivering cutting edge digital platforms.&nbsp; We are bound by our diversification of work subject matter, and the reality that at our core we are builders.</p>"
}