{
  "url": "https://netamorphosis.com/results/clients/amma/",
  "name": "Amma",
  "subtitle": "When neta’s founder ventured to Kerala, India to receive a hug from the world’s hugging guru, she found neta’s very first client, the team at Amritapuri.",
  "body": "<section class=\"result_sidebar\"><h3 class=\"result_logo\"> <a href=\"http://www.embracingtheworld.org/\" target=\"_blank\"> <img width=\"130\" height=\"75\" src=\"https://netamorphosis.com/wp-content/uploads/2017/03/amma-logo-01.png\" class=\"attachment-full size-full\" alt=\"Results - Amma | netamorphosis\" srcset=\"https://netamorphosis.com/wp-content/uploads/2017/03/amma-logo-01.png 130w, https://netamorphosis.com/wp-content/uploads/2017/03/amma-logo-01-128x75.png 128w\" sizes=\"(max-width: 130px) 100vw, 130px\">  </a></h3><p> <a href=\"http://www.embracingtheworld.org/\" target=\"_blank\" class=\"result_url\">embracingtheworld.org</a></p><h3>Sector</h3><p> NGO</p><h3>Services</h3><ul class=\"services_list\"><li class=\"service service_strategy\">  <i></i><span>Strategy</span></li><li class=\"service service_omnichannel\">  <i></i><span>Omnichannel</span></li><li class=\"service service_ux-design\">  <i></i><span>UX Design</span></li><li class=\"service service_content-creation\">  <i></i><span>Content Creation</span></li><li class=\"service service_technology\">  <i></i><span>Technology</span></li></ul><section class=\"share\"><div class=\"vc_btn3-container vc_btn3-left\"> <a class=\"vc_general vc_btn3 vc_btn3-size-lg vc_btn3-shape-square vc_btn3-style-flat vc_btn3-color-black\" href=\"#share\" data-toggle=\"modal\" data-target=\"#share-this\">Share This</a></div></section></section><p>With a hug that embraces the world, <span class=\"netamorphosis\">netamorphosis</span> was born.</p><h2>Discovering unparalleled humanitarian efforts halfway around the world.</h2><p>During a visit to Amma’s ashram, Amritapuri, <span class=\"netamorphosis\">neta</span> found its first client and in essence was born. Amma, the world’s hugging guru, has hugged more than 33 million people worldwide; thousands flock to Amritapuri every day to see her and receive their ‘darshan’, which means an ‘auspicious sight’ in Sanskrit, and in the realm of Amma translates to ‘receive a hug’.</p><h2>Helping to leverage Amma’s digital footprint to heighten visibility of her humanitarian efforts, in order to successfully drive recognition amongst global world leaders.</h2><p>Shortly upon arrival to Amritapuri, Lyde inquired and learned that Amma’s marketing materials that were used to spread her&nbsp;teachings, her incredible volunteer work and Amritapuri’s programs, primarily consisted of paper pamphlets and brochures in more than 8 languages. This was counterintuitive to the extreme conservation (and cost saving) principles the ashram carried out in its daily life, and Lyde sought out to support Amma’s <a href=\"https://netamorphosis.com/services/omnichannel/\"><strong>omnichannel</strong></a><strong> strategy,</strong> which consisted of personal appearances around the world. As it turned out, Amma’s birthday was arriving in 6 short weeks, and as a birthday present, members of the ashram were preparing a re-design of the Amritapuri website. When learning that Lyde had developed <strong><a href=\"https://netamorphosis.com/services/strategy/\">strategic planning&nbsp;</a></strong>and subsequently implemented web strategies for the largest companies in the world ranging from <a href=\"https://www.jpmorganchase.com/\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>JP Morgan Chase</strong></a>, <a href=\"https://www.us.hsbc.com/1/2/home/personal-banking\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>HSBC</strong></a> to <a href=\"https://www.moma.org/\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>MoMA</strong></a> and <a href=\"https://www.zara.com/us/\" target=\"_blank\" rel=\"noopener noreferrer\"><strong>ZARA</strong></a>, a meeting with key members on the project was conducted to better understand what Lyde could bring to the ‘proverbial table’.</p><p>It was determined shortly following this initial meeting, that as part of Lyde’s&nbsp;seva (i.e. ‘volunteer work’ or in Indian religions, work offered to God), she&nbsp;would work with the existing website team members that consisted of a project/technical lead, who was tasked with&nbsp;<a href=\"https://netamorphosis.com/services/ux-design/\"><strong>UX</strong></a>&nbsp;design and programming, a database admin, an&nbsp;<a href=\"https://netamorphosis.com/services/seo-services/\"><strong>SEO</strong></a>&nbsp;specialist and miscellaneous coders. There were a few challenges and goals that the new and improved site hoped to accomplish. At the most basic level, first was effective virtual translation of the act of receiving a hug and second was extending Amma’s presence in all of its forms and humanitarian endeavors throughout, India, South East Asia and the world. There were also questions surrounding Amma’s community building through utilizing a hybrid of individual domain properties vs. aggregating social media channels to foster community and connection to those inspired by Amma, in the most efficient and productive way possible. Lastly, there was an education component to heighten visibility of Amma’s humanitarian efforts driving recognition amongst global world leaders, through the naming and development of a new web platform, embracingtheworld.org.</p>"
}