{
  "url": "https://netamorphosis.com/results/clients/ryu/",
  "name": "RYU",
  "subtitle": "A total brand-reboot and replatforming, centered around a digitally-centric eCommerce destination that prioritized the objective of putting RYU's high-tech athletic apparel and their customer base of urban athletes at the core of a unique omnichannel user experience.",
  "body": "<section class=\"result_sidebar\"><h3 class=\"result_logo\"> <a href=\"http://www.ryu.com \" target=\"_blank\"> <img width=\"130\" height=\"130\" src=\"https://netamorphosis.com/wp-content/uploads/2018/10/results-respect-your-universe-logo.png\" class=\"attachment-full size-full\" alt=\"netamorphosis | RYU Logo\">  </a></h3><p> <a href=\"http://www.ryu.com \" target=\"_blank\" class=\"result_url\">ryu.com</a></p><h3>Sector</h3><p> Athletic Apparel</p><h3>Services</h3><ul class=\"services_list\"><li class=\"service service_strategy\">  <i></i><span>Strategy</span></li><li class=\"service service_omnichannel\">  <i></i><span>Omnichannel</span></li><li class=\"service service_ecommerce\">  <i></i><span>eCommerce</span></li><li class=\"service service_analytics-consulting\">  <i></i><span>Analytics Consulting</span></li><li class=\"service service_seo-services\">  <i></i><span>SEO Services</span></li><li class=\"service service_ux-design\">  <i></i><span>UX Design</span></li><li class=\"service service_content-creation\">  <i></i><span>Content Creation</span></li><li class=\"service service_cms-implementation\">  <i></i><span>CMS Implementation</span></li><li class=\"service service_performance-management\">  <i></i><span>Performance Management</span></li><li class=\"service service_technology\">  <i></i><span>Technology</span></li><li class=\"service service_maintenance-hosting\">  <i></i><span>Maintenance &amp; Hosting</span></li></ul><section class=\"share\"><div class=\"vc_btn3-container vc_btn3-left\"> <a class=\"vc_general vc_btn3 vc_btn3-size-lg vc_btn3-shape-square vc_btn3-style-flat vc_btn3-color-black\" href=\"#share\" data-toggle=\"modal\" data-target=\"#share-this\">Share This</a></div></section></section><h2><strong>What building an urban centric, digitally focused, omnichannel brand looks like in one of the most competitive segments of the fashion industry – athletic apparel.</strong></h2><p>Think of <em>Apple</em>, but for athletic apparel, and you’ll get <a href=\"http://www.ryu.com\" target=\"_blank\" rel=\"noopener\"><strong>RYU apparel</strong></a>.</p><p>Founded in Oregon in 2008 and re-launched in 2015 when current President and CEO Marcello Leone acquired the company, RYU is <em>the</em> perfect aspirational brand for all those seeking technical athletic apparel, innovative fabrics and high-performing designs to wear when training, running, or going to and from a workout. RYU’s offering of uber-distinctive and high-quality products, matched with the booming community of like-minded individuals that is gathering around the brand—what we might term today’s urban athlete—are here to service all needs of their core consumer base, above and beyond sport.</p><p>In fact, there’s more than just pure play: RYU is also known for its <strong><a href=\"https://netamorphosis.com/insights/glossary/corporate-social-responsibility/\">Corporate Social Responsibility</a></strong> (CSR) commitment, its award-winning patented designs, and is a recognized thought leader in the field of mental health awareness thanks to its #OneMoreRep campaign, recognized as social media campaign of the year in 2017. RYU has 9 stores across Canada and the US, as well as monthly offline events, giving n e t a the ideal ingredients to initiate a digital replatforming and re-branding of an incredible brand. RYU is offering the right product at the right time to the right consumer, with a 2018-relevant message that puts customers at the center of the <strong><a href=\"https://netamorphosis.com/services/omnichannel/\">omnichannel</a></strong> experience.</p><h2><strong>Enter n e t a. Challenge: How to digitally re-platform, re-brand and accelerate growth in one of the fastest growing sectors in fashion – athletic apparel.</strong></h2><p>n e t a’s fundamental starting point for laying the foundation for scalable success and paving the way forward for all resources and partners executing a re-branding or replatforming is through our <strong><a href=\"https://netamorphosis.com/services/strategy/\">Strategy</a></strong> engagement. Within the <strong><a href=\"https://www.statista.com/statistics/254489/total-revenue-of-the-global-sports-apparel-market/\" target=\"_blank\" rel=\"noopener\">hyper-competitive athletic apparel space</a>,</strong> the top 5 take-aways that we prioritized for RYU were:</p><ol><li>Selectivity and exclusivity: appeal to the specific needs of customers with diverse body types and physical pursuits.</li><li>Digital simplicity, design and tonality cannot be underestimated and should be commensurate with RYU’s product design, marrying utility, technology and effective ‘marketing’ throughout all customer interactions.</li><li>Simplify, yet be 1 step better than the competition as it relates to policies such as: customer guarantees, return processing and back-end order processing for RYU.</li><li>Quality is aspirational, and innovation is key: incorporate tagging, iconography, and visually stimulating education of patents and technical features.</li><li>Make the community work for you, with you. Cultivate loyalty, leverage offline events and let the customers do the talking on RYU’s products.</li></ol>"
}