{
  "url": "https://netamorphosis.com/about/team/alia-carangelo/",
  "name": "Alia Carangelo",
  "jobTitle": "SEO Specialist & Digital Project Coordinator",
  "linkedin": "https://www.linkedin.com/in/alia-carangelo-266718b0/",
  "bioSections": [
    "Alia is our SEO specialist &amp; digital project coordinator who specializes in delivering all things <strong><a href=\"https://netamorphosis.com/services/seo-services/\">SEO</a></strong>: SEO advice and audits, content strategies, keyword targeting and writing, and technical SEO tactics that serve as a cornerstone of our transformative client digital growth strategies. Alia came to us from Treehouse Internet Marketing Group, where she honed her SEO skills and UX preferences, while in the day to day of extensive projects in software development.",
    "A week in the role of a Digital Project Coordinator and SEO specialist may include: conducting an SEO Audit; copy-editing blog posts for client websites; preparing eCommerce inventory; proofing documents; coordinating collaboration, defining plugins for inter-web best practices for gaining visibility…all days encompassed in a collaborative relationship with n e t a’s client services team and working hand-in-hand with our clients.",
    "Upon graduating from <a href=\"https://www.southernct.edu/\">Southern Connecticut State University</a> with a BS in Journalism and a minor in Communications, Alia has developed a true passion for the written word and client interaction. Her communication and versatility in adapting to multiple environments ensures that neta clients receive comfortable, clear and confident support throughout our work with them.",
    "Alia was born in Waterbury, Connecticut, and grew up in Wolcott, Connecticut. Being from a small town, she has always been eager to travel. After traveling a bunch, including a backpacking trip throughout Europe, she finally wound up fulfilling her lifelong dream of living in the big city of New York City!",
    "Photography by Ryan Roberts | Hair &amp; Makeup by Thom Woods"
  ],
  "ownWords": [
    "I have always been an extremely hard worker; there was no obstacle I didn’t want to overcome, whether it was with a job or in my personal life. That being said, I have had jobs and personal experiences that have allowed me to exercise a variety of different skill-sets – customer service, project management, hospitality, cultural adaptations and internet marketing to name a few. It feels good to be a part of the n e t a team where I am utilizing skills that I’d like to see myself grow into."
  ]
}