{
  "url": "https://netamorphosis.com/about/team/brittany-queeney/",
  "name": "Brittany Queeney",
  "jobTitle": "Director of Operations",
  "linkedin": "https://www.linkedin.com/in/brittany-queeney-59804316",
  "bioSections": [
    "Brittany is our Director of Operations, with her primary focus being the development of n e t a m o r p h o s i s’ very own growth and internal operations management; using technology, communications and data and analytics to streamline n e t a’s future operations to become the highest functioning digital growth agency possible.",
    "Using her organizational skills coupled with an innate ability to discover the path of least resistance to achieve desired goals, she remains calm and poised in what is a high performing work environment. Process improvements and creating team and systemic efficiencies is her jam, and vital to the continued evolution of n e t a and the growth trajectories of our clients.",
    "She graduated from <strong><a href=\"https://www.anderson.edu/\">Anderson University</a></strong>, Indiana, with a BA in Music Business. Her first job in artist management and concert booking brought her to New York City. While working for a music broadcasting company, she found her love of operations and a desire for understanding what made things run, which attracted her to her role at <span class=\"netamorphosis\">neta</span>.",
    "Brittany was born in Denver, CO. When she was ten after seeing her first musical, she declared to her family that she would someday move to New York to be on Broadway. While life had other career plans in mind for her, she is happy that 25 years after making her proclamation, she is living her dream with her husband and fur baby in the biggest city in the world.",
    "Photography by Ryan Roberts | Hair &amp; Makeup by Thom Woods"
  ],
  "ownWords": [
    "Joining the #netafam has been a life-changing opportunity for me. I believe as humans we desire to work somewhere that values our opinions, and utilizes our skills to improve not only the business but enhance our lives. <span class=\"netamorphosis\">neta</span> has allowed me to evolve my skills in operational project management, and contribute to the team in an impactful way."
  ]
}