{
  "url": "https://netamorphosis.com/about/team/carly-link/",
  "name": "Carly Link",
  "jobTitle": "Sr. UX Design Manager",
  "linkedin": "https://www.linkedin.com/in/carly-link-3a434b8b",
  "bioSections": [
    "<span class=\"s1\">Carly Link serves as the liaison between <span class=\"netamorphosis\">neta</span>’s clients and all design, programming, photography and production resources through planning and executing phases of all ‘build’ projects.&nbsp; Throughout all <span class=\"netamorphosis\">neta</span> client engagements, Carly provides support through project management, strategic planning, and design services such as user experience design (<a href=\"https://netamorphosis.com/services/ux-design/\">UX design)</a> and interior design, while ensuring that timelines and quality standards are adhered to for everything that has our collective names on it.&nbsp;</span>",
    "Carly joined <span class=\"netamorphosis\">neta</span> in July 2012 with a background in Interior Design. She graduated Magna Cum Laude from San Diego State University with a BA in Interior Design. During college, she studied Architecture + Design abroad in Copenhagen, Denmark, which further expanded her love of both design and travel. After graduation, Carly was a Junior Designer at Young + Co. Inc., a commercial design firm in San Diego where she executed space planning, budgeting and furniture + material selections for a range of commercial projects. A desire for adventure brought her to New York City in the Spring of 2012.",
    "Carly grew up in Dallas, TX – although you’d never guess it because the accent never caught on. A true California girl at heart, she re-located to San Diego in the summer&nbsp;of 2015, and telecommutes as ‘Carlybot’ to our NYC office, where she still keeps us all in line, while loving sunshine, the beach and the occasional In-N-Out.",
    "Photography by Adrian Barry &amp; Ryan Roberts | Hair &amp; Makeup by Takashi Ashizawa &amp; Thom Woods"
  ],
  "ownWords": [
    "My favorite part of working at <span class=\"netamorphosis\">neta</span> is being able to work with passionate people who are filled with creative energy. It’s amazing what the mix of vision, organization and collaboration can accomplish.",
    "I’ve always loved creating. From building forts and sandcastles as a kid to building web platforms with our clients today, I find that working together with a team to materialize an idea into reality is one of the most fulfilling and exciting experiences."
  ]
}