{
  "url": "https://netamorphosis.com/about/team/ciara-gormley/",
  "name": "Ciara Gormley",
  "jobTitle": "SEO & Team Building Manager",
  "linkedin": "https://www.linkedin.com/in/ciara-gormley-470125a5/",
  "bioSections": [
    "Ciara is not one to shy away from taking on two roles, as most people on our dynamic, agile #netafam team are prone to do! As our SEO &amp; Team Building Manager, she splits her time between overseeing and executing our core SEO offering and hiring, onboarding and assisting with HR for neta employees. Within our SEO offering, she oversees the SEO team that delivers SEO audits, content strategies, keyword targeting and writing, and technical SEO tactics that serve as a corner stone of our transformative client digital growth strategies. Our foundation is to create an <strong><a href=\"https://netamorphosis.com/join-us/\">employee-centric</a></strong> company culture that did not exist within a traditional agency or consulting model. &nbsp;One element of Ciara’s primary functions as Team Building Manager is that while neta continues to grow and mature, to uphold the values of neta’s work life balance (an anomaly for a start-up and growth-centric environment), and to evolve its learning culture where its members feel both valued and can thrive.",
    "She graduated from UCD, Ireland with a BA in English and then progressed to a Post Grad in PR and Event Management. After early professional exposure in PR, she realized she wanted to find a place she could continue to learn and grow, which brought her to neta, following a leap State-side, from her homeland of Ireland.",
    "Essential to the cross-functional team and productivity goals inherent in neta’s working-style, Ciara uses her organizational skills to ensure smooth operations in what is often a busy work environment. She is integral to internal operations, our recruitment process (Team Building) and the continued evolution of our on-boarding, which aims at setting new team members ‘up for success’ as effectively and efficiently as possible, as well as, being the point person for everything SEO-related within neta and for our clients.",
    "Ciara was born in Queens, NY, but raised in Ireland. She’s enjoying getting back to her New York roots and, although she’d never want (or be able!) to lose her Irish accent, finds that she is speaking more and more like a New Yorker every day!",
    "Photography by Ryan Roberts | Hair &amp; Makeup by Takashi Ashizawa"
  ],
  "ownWords": [
    "Working at neta is an exciting journey of learning and growth, where you can’t help but soak up the knowledge of the creative and talented people around you.",
    "I’ve always aspired to work in an environment that values its employee’s contributions and ideas, and believe in the importance of fostering team building, which is what I’ve found at neta. Working across two important sectors of the company provides me with opportunities to be strategic and grow my technical knowledge, while not losing the importance of building relationships and helping to foster continued growth. No two days are the same and as someone who can’t handle boredom, I absolutely love and thrive on the fast-paced excitement of everyday life at neta."
  ]
}