{
  "url": "https://netamorphosis.com/about/team/henri-paget/",
  "name": "Henri Paget",
  "jobTitle": "Senior Content Strategist",
  "linkedin": "https://www.linkedin.com/in/henripaget/",
  "bioSections": [
    "As our Senior Content Strategist, Henri is responsible for delivering n e t a’s digital growth strategies in partnership with our clients and laying the foundation for what achieving maximum success can look like. Henri takes a lead role with our clients in developing compelling content strategies that convert audiences and is fundamental in execution of end-to-end production, as a fully integrated team member along with our UX/design team and data analysts.",
    "Henri joins n e t a after moving to New York from Australia, bringing 10 years of diverse digital experience and leadership in cutting-edge journalism and data-driven content optimization. He was the founding executive producer of one of Australia’s top news websites, where he&nbsp;managed a team of 15 journalists and videographers, driving both trending daily news coverage, as well as, news platform innovation. Among the highlights was covering the 2016 Olympics from Rio de Janeiro, where he wrote and produced stories, videos and VR news content from the sidelines of the biggest sports events in the world.",
    "Henri transferred his skills from journalism to the world of <a href=\"https://netamorphosis.com/services/ecommerce/\">eCommerce</a> at <a href=\"https://www.qantas.com/au/en.html\" target=\"_blank\" rel=\"noopener noreferrer\">Qantas</a>, Australia’s leading airline, where he oversaw the translation of their web properties into 6 different languages, with a comprehensive strategy that boosted <a href=\"https://netamorphosis.com/services/seo-services/\">SEO</a> and conversion rates, while delivering detailed data insights and reporting to the company’s international teams.",
    "Henri has a keen eye for creating engaging stories that drive exceptional results, whether the goal is video views, conversions, open rates, click through rates or all of the above. Steeped in a <a href=\"https://netamorphosis.com/services/analytics-consulting/\">data-driven approach</a>, he is constantly testing and learning to find new ways to drive engagement and grow audiences.",
    "Like many Aussies, Henri is an avid traveler and has crisscrossed the globe multiple times, both as a tourist and on assignment. He’s studied Portuguese language for several years and spent the end of 2017 walking more than 370 miles through the Portuguese and Spanish countryside on the Camino de Santiago. Despite the blisters, it was a blast!",
    "Photography by Keith Greenbaum"
  ],
  "ownWords": [
    "Every brand or product has a story to be told, and often the most compelling and relatable way to tell it is through the eyes of an outsider. Working with n e t a gives me the opportunity to meet with industry leaders and the teams behind groundbreaking startups, learn their stories and uncover the best way to help them connect with their core audiences and set themselves up to achieve their greatest audience engagement potential."
  ]
}