{
  "url": "https://netamorphosis.com/about/team/kirsten-brittle/",
  "name": "Kirsten Brittle",
  "jobTitle": "Social Media Manager",
  "linkedin": "https://www.linkedin.com/in/kirsten-brittle-976a52104/",
  "bioSections": [
    "Kirsten is the n e t a m o r p h o s i s Social Media Manager which includes being an integral part of the @neta_morphosis social channels. You’ll find Kirsten coordinating with one of our amazing clients, in our BTS on Instagram Stories or helping create an awesome, team-centric work environment.",
    "She is a &nbsp;Kennesaw State University class of 2017 alum with a love for marketing, content creation, and social media strategy and through early professional experience with luxury fashion brands, also discovered a desire for all things innovative and forward-thinking, which ultimately led her to n e t a and an opportunity to further develop these passions as our Social Media Manager.",
    "Essential to the cross-functional team and productivity goals inherent in n e t a’s working-style, Kirsten remains integral to internal operations which serve as our backbone, and really is the outward face of neta from the first person you meet when you arrive to our <a href=\"https://netamorphosis.com/office/\">office</a>, in addition to being a primary contributor to our <a href=\"https://www.instagram.com/neta_morphosis/\" target=\"_blank\" rel=\"noopener noreferrer\">Instagram</a> business account.",
    "Kirsten was born in Atlanta, Georgia and moved to the Upper East Side upon graduation (<em>Morning, Upper East Siders!).</em> Having recently moved to the more urban, free spirited neighborhood of East Village where fun is found on every corner, something tells us she’s beginning to find her new home in the big apple just fine!",
    "Photography by Keith Greenbaum"
  ],
  "ownWords": [
    "Picture an intimate yet dynamic group of talented thinkers whose brilliance breathes life into creative and strategic work day in and day out and you get n e t a.",
    "I came to netamorphosis to find a place that fostered growth, challenges, and reward for innovative thinking, but most importantly, to find people who are passionate about the work they create.",
    "What I didn’t expect to find were a group of individuals, inversely unique and from all over the world, sharing in the same value of achieving greatness, both personally as we celebrate milestone wins, and professionally as new opportunities arise to develop them to their full potential.",
    "Playing a role in the nurturing and development of the neta culture and #netafam has given me a fulfilling purpose and abundance of gratitude beyond the desks and walls that house our team. When we come together, we are fearless and able to overcome the omnipresent unknowns that arise as a pioneering digital marketing agency.",
    "To grow, to learn, to challenge, to fail and to succeed, that is what sets my heart on fire and that is n e t a."
  ]
}