{
  "url": "https://netamorphosis.com/about/team/phillip-jones/",
  "name": "Phillip Jones",
  "jobTitle": "Data Science & Financial Analyst",
  "linkedin": "https://www.linkedin.com/in/phillipjones561/",
  "bioSections": [
    "Phillip is one of n e t a’s Data Science &amp; Financial Analysts, supporting the metrics, data consulting, financial modeling and financial planning that ultimately plots the fiscal growth of our clients. This work translates into client-centric fiscal reporting systems utilizing big data that quantifies dynamic growth trajectories.&nbsp; Phillip is also a vital lead in our <strong><a href=\"https://netamorphosis.com/services/seo-services/\">SEO Services Offering</a></strong>, where a primary objective is to identify what we consider ‘core keywords’, from which to position site platforms and client publishing criteria to compete and ‘win’ in Google’s ever-changing algorithms.",
    "Within Phillip’s role at neta, he ‘develops and mans’ our financial analysis and defines performance metrics for our clients in the Fashion, Medical/Health/Wellness, Luxury Retail, Beauty, the Arts and Home/Lifestyle sectors.",
    "Phillip graduated from the <strong><a href=\"https://www.uga.edu/\" target=\"_blank\" rel=\"noopener\">University of Georgia</a> </strong>with honors and degrees in Economics and Statistics. While at UGA, Phillip sought opportunities abroad and in Athens, Georgia to work on interesting research projects that allowed for interaction with people who are passionate about their work. At n e t a, he found an identical environment in which learning and innovation is encouraged,&nbsp;and in which there is never a shortage of insights to be discovered.",
    "Phillip was born and raised outside of Atlanta, Georgia and just recently made the move up to New York. Baffled by the city, he still lives here like a tourist, spending his weekends exploring the near infinite number of streets and parks of New York City.",
    "Photography by Ryan Roberts | Hair &amp; Makeup by Thom Woods"
  ],
  "ownWords": [
    "I’ve always been an extremely curious person, and I enjoy diving into the nitty gritty of how things work. Connecting cause with effect or finally understanding a complex system has always given a rush that I found absolutely thrilling.&nbsp;&nbsp;With n e t a’s wide variety of clients and our dynamic work environment, “why” and “what if” questions are never in short-supply, and I always feel like there is something new to discover."
  ]
}