{
  "url": "https://netamorphosis.com/about/team/ryan-roberts/",
  "name": "Ryan Roberts",
  "jobTitle": "Photography & Content",
  "linkedin": "https://www.linkedin.com/in/jryanrobertscom/",
  "bioSections": [
    "Ryan Roberts serves as one of our leads within Creative Content, leading the way for visual content depiction for <span class=\"netamorphosis\">neta</span> and our clients through user experience design and other creative offerings. His dynamic background, ranging from commercial real estate to commercial photography has provided Ryan the confidence and ability to identify obstacles and create solutions in diverse situations. Through his photography experience, Ryan brings a strong visual sense to the collaborative n e t a approach and applies it across creating graphics, photography assets and collaborating within <span class=\"netamorphosis\">neta</span>’s award-winning digital design team. Additionally, Ryan applies his commercial photography experience towards <span class=\"netamorphosis\">neta</span>’s soup-to-nuts <a href=\"https://netamorphosis.com/services/content-creation/\"><strong>content creation</strong></a> and production planning.",
    "Ryan graduated with a Bachelor of Science degree in Finance from <strong><a href=\"https://www.fsu.edu/\">Florida State University</a></strong>. Born and raised in Tampa, FL he considers himself a southerner although <a href=\"https://netamorphosis.com/about/team/lyde-spann/\"><strong>Lyde</strong></a> likes to challenge him on whether or not Florida is in the South, being a North Carolinian.&nbsp;Thirteen years after booking a one-way flight to NYC, Ryan joined <span class=\"netamorphosis\">neta</span> because he shared in our company culture and mantra “…if you’re no longer learning, you’re no longer growing”.&nbsp;In his initial interviews, anytime job title was brought up he simply responded “Swiss Army knife” which we attributed to entrepreneurial spirit and years of running his own small business.",
    "“Go confidently in the direction of your dreams! Live the life you’ve imagined. As you simplify your life, the laws of the universe will be simpler.”",
    "– Henry David Thoreau",
    "Photography by Ryan Roberts"
  ],
  "ownWords": [
    "I’m at my best when learning new skill sets and tackling problems. Through my years in commercial real estate brokerage I learned invaluable lessons about identifying and negotiating priorities of opposing parties in transactions. A creative at heart, I couldn’t resist the calling to head to NYC and spend 10 years shooting photo jobs for international magazines and brands. Those years taught me to wear many hats running my own business, but perhaps the most important lesson was to never identify a problem without simultaneously beginning to seek its solution. When I’m not in the office I’m running around NYC with my wife and son continuing to act like tourists…yes even 13 years later."
  ]
}