{
  "url": "https://netamorphosis.com/about/team/sally-smith/",
  "name": "Sally Smith",
  "jobTitle": "Digital Project Coordinator",
  "linkedin": "https://www.linkedin.com/in/sallyjanesmith/",
  "bioSections": [
    "Sally joined n e t a m o r p h o s i s as&nbsp;a Digital Project Coordinator (DPC) – a role that ensures we consistently&nbsp;exceed our client’s expectations. You will find&nbsp;Sally&nbsp;playing point on communications with many of our clients. On top of her responsibilities as an account coordinator, Sally also assists in preparing&nbsp;client&nbsp;deliverables in the Information Architecture-Planning and <strong><a href=\"https://netamorphosis.com/services/ux-design/\">Design/UX</a> </strong>phases of work. When Sally isn’t tackling client work, she is project coordinating our&nbsp;newly strategized, freshened-up Instagram (follow us ya’ll:<strong><a href=\"https://www.instagram.com/neta_morphosis/\">@neta_morphosis</a></strong>).",
    "Sally graduated cum laude from <strong><a href=\"https://www.furman.edu/\" target=\"_blank\" rel=\"noopener\">Furman University</a></strong>, where she majored in Communication Studies and Spanish. Prior to graduating, she worked at the Manhattan-based ecommerce startup, Keep.com; first as a Customer Service Representative and then as a Digital Marketing Intern. Sally’s love for creative client engagement and innovative digital content was spawned here.&nbsp;She is very excited to continue down this path at n e t a.",
    "Sally was born in Charlotte, North Carolina, but raised in Westchester, New York. She appreciates the hospitable vibe of the south, as well as, the contagious energy of New York City. After attending college in South Carolina, Sally decided to come back north to start her career in the mecca of digital marketing. The allure of the work (and New York City pizza) was <em>too</em> great to resist! Outside of work, Sally loves to run; she soon hopes to tackle the New York City marathon, which will be her third 26.2-mile race.",
    "Photography by Ryan Roberts | Makeup by Thom Woods"
  ],
  "ownWords": [
    "I have worked with go-getters&nbsp;before, but never with a group that is as committed and passionate as the team here at n e t a. No one is afraid to dig in and take on a challenge. It’s awesome to see both senior and junior&nbsp;colleagues learning and growing each day. We spend a lot of time together at 15W 26<sup>th</sup>&nbsp;Street, but it’s rewarding to know that we are&nbsp;all valued and driven to deliver great work in partnership with our clients."
  ]
}