{
  "url": "https://netamorphosis.com/about/team/samantha-loiacono/",
  "name": "Samantha Loiacono",
  "jobTitle": "Sr Visual & Graphic UX Designer",
  "linkedin": "https://www.linkedin.com/in/samanthaloiacono/",
  "bioSections": [
    "Bringing more than 5 years of web and graphic design experience for top visual brands such as <strong><a href=\"https://us.louisvuitton.com/eng-us/homepage\" target=\"_blank\" rel=\"noopener\">Louis Vuitton</a>, <a href=\"https://www.kiehls.com/\" target=\"_blank\" rel=\"noopener\">Khiel’s</a>, <a href=\"https://www.elizabetharden.com/\" target=\"_blank\" rel=\"noopener\">Elizabeth Arden</a>, </strong>and <strong><a href=\"https://www.walmart.com/\" target=\"_blank\" rel=\"noopener\">Wal-Mart</a>, </strong>Samantha (aka “Sam”) is our Senior Visual and Graphic UX Designer. She is mainly responsible for producing high-quality visual <strong><a href=\"https://netamorphosis.com/services/ux-design/\">graphic designs</a></strong> from concept to responsive execution, including those for desktop, web, and mobile devices. Sam’s strength is in visual content, she strengthens our client’s visual assets from video to fully produced photography shoots; creating and iterating <strong><a href=\"https://netamorphosis.com/services/content-creation/\">visual assets</a></strong> that reflect our client’s brands that results in a visual language that breathes life and dynamism into web architecture.",
    "Samantha joined n e t a in May 2018 with a background in Art Direction and Visual Design. She graduated from <strong><a href=\"https://www.pratt.edu/\">Pratt Institute</a></strong> with a BFA in Communication Design. During her time at Pratt she specialized in branding and illustration. After graduation, Samantha was a Junior Art Direction at Global Association of Risk Professionals, a risk management firm, where she fell in love with UX/UI Design and has since worked at corporations and agencies alike for brands such as Elizabeth Arden, Louis Vuitton, Coach, Sam’s Club, Walmart.com, GE, Mickey Mouse Club and more.",
    "Sam was born in Upstate, NY and although she’s been a New Yorker her whole life is happiest when she’s traveling the world and experiencing new places. Her goal is to visit 30 countries before she’s 30.",
    "Photography by Ryan Roberts | Hair &amp; Makeup by Thom Woods"
  ],
  "ownWords": [
    "My favorite part of working at n e t a is we’re such a diverse yet talented group of people who are able to wear multiple hats and take on multiple roles to get the job done. It’s really inspiring to watch everyone here work and to be a part of a growing team that creates together."
  ]
}